<?php

namespace services;

class TicketService
{
    private PaymentService  $paymentService;

    public function buyTicket()
    {

        //воно перевіряє чи в користувача будуть гроши на акаунтах, в разі якшо так, то викличе методу
        //в пеймент сервісі яка створить транзакцію, і віднімить гроши з акаунта, в рефаунді перевірить всі умови, додасть
        //гроші з аналогічним сценарієм логіка з перевіркою буде винесена в пеймент сервіс
        //
        //
    }
    /*
     * refund
     * getAllByUserId
     *
     *
     * */

}